DataProcessors/НумерацияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>НумерацияДокументов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/НумерацияДокументов/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Если ЭтаФорма.Параметры.Свойство("Период") Тогда
		Объект.Период = ЭтаФорма.Параметры.Период;
	Иначе
		Объект.Период = Новый СтандартныйПериод(НачалоМесяца(НачалоМесяца(ТекущаяДатаСеанса()) - 86400), ТекущаяДатаСеанса() - 86400); // от начала пред. месяца до вчерашней даты
	КонецЕсли;
	
	Если ЭтаФорма.Параметры.Свойство("ТолькоТребующиеПеренумерации") Тогда
		ЭтаФорма.ТолькоТребующиеПеренумерации = ЭтаФорма.Параметры.ТолькоТребующиеПеренумерации;
	ИначеЕсли Объект.Период.ДатаНачала >= '20171001' Тогда
		ЭтаФорма.ТолькоТребующиеПеренумерации = Истина;
	КонецЕсли;
	
	Попытка	
		ОбновитьНаСервере();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	НастроитьВидимостьДоступность(ЭтаФорма);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СОБЫТИЯ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Если Объект.Период.ДатаНачала < '20171001' Тогда
		ЭтаФорма.ТолькоТребующиеПеренумерации = Ложь;
	КонецЕсли;
	
	НастроитьВидимостьДоступность(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСчетуВнутреннегоУчетаПриИзменении(Элемент)
	
	Если Не ЭтаФорма.ОтборПоСчетуВнутреннегоУчета Тогда
		Объект.СчетДоверительногоУправления = Неопределено;
	КонецЕсли;
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ ФОРМЫ

&НаКлиенте
Процедура КомандаПеренумеровать(Команда)
	
	ТипыИзмененныхОбъектов = Новый Массив;
	
	ПеренумероватьДокументыНаСервере(ТипыИзмененныхОбъектов);
	
	Для каждого ТипИзмененногоОбъекта Из ТипыИзмененныхОбъектов Цикл
		ОповеститьОбИзменении(ТипИзмененногоОбъекта);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		ОбновитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьДокумент(Команда)
	
	ТекущиеДанные = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если АдресаСохраненныхДанных <> Неопределено И ТекущиеДанные.Свойство("ИдентификаторСтроки") Тогда 
		
		Значение = ПолучитьОбъектИзСохраненныхДанных(АдресаСохраненныхДанных[ЭтаФорма.ТекущийЭлемент.Имя], ТекущиеДанные.ИдентификаторСтроки)	
		
	Иначе
		
		Если ТипЗнч(ТекущиеДанные.Объект) <> Тип("Дата") Тогда
			Значение = ТекущиеДанные.Объект;
		КонецЕсли;		
		
	КонецЕсли;
	
	Если Значение <> Неопределено Тогда
		ОткрытьЗначение(Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаПоказатьРасхождения(Команда)
	
	НайтиРасхожденияНаСервере().Показать();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ФУНКЦИИ

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)
	
	Форма.Элементы.СчетДоверительногоУправления.Видимость = Форма.ОтборПоСчетуВнутреннегоУчета;
	
	Форма.Элементы.ТолькоТребующиеПеренумерации.Доступность = (Форма.Объект.Период.ДатаНачала >= '20171001');
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОбъектИзСохраненныхДанных(АдресСохраненныхДанных, ИдентификаторСтроки)
	
	СохраненныеДанные = ПолучитьИзВременногоХранилища(АдресСохраненныхДанных);
	
	СтрокаОбъекта = СохраненныеДанные.Строки.Найти(ИдентификаторСтроки, "ИдентификаторСтроки", Истина);
	
	Возврат ?(СтрокаОбъекта = Неопределено, Неопределено, СтрокаОбъекта.Объект);

КонецФункции

&НаСервере
Процедура ПеренумероватьДокументыНаСервере(ТипыИзмененныхОбъектов)
	
	Если АдресаСохраненныхДанных = Неопределено Тогда
		
		// Восстанавливаем результаты проверки из данных формы	
		
		РезультатПроверки = Новый Структура("ПомеченныеНаУдалениеДокументы,БиржевыеСделки,БиржевыеСделкиРЕПО,ВнебиржевыеСделки,Поручения,ИныеОперации",
		    Новый Структура("Данные", РеквизитФормыВЗначение("ПомеченныеНаУдалениеДокументы")),
			Новый Структура("Данные", РеквизитФормыВЗначение("БиржевыеСделки")),
			Новый Структура("Данные", РеквизитФормыВЗначение("БиржевыеСделкиРЕПО")),
			Новый Структура("Данные", РеквизитФормыВЗначение("ВнебиржевыеСделки")),
			Новый Структура("Данные", РеквизитФормыВЗначение("Поручения")),
			Новый Структура("Данные", РеквизитФормыВЗначение("ИныеОперации"))
		);
		
	Иначе
		
		// Берем сохраненные данные из временного хранилища
		
		РезультатПроверки = Новый Структура;
		Для Каждого АдресСохраненныхДанных Из АдресаСохраненныхДанных Цикл
			РезультатПроверки.Вставить(АдресСохраненныхДанных.Ключ, Новый Структура("Данные", ПолучитьИзВременногоХранилища(АдресСохраненныхДанных.Значение)));
		КонецЦикла;
		
	КонецЕсли;
		
	// Перенумеровываем
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПеренумероватьДокументы(РезультатПроверки, ТипыИзмененныхОбъектов);
	
	// Выполняем повторную проверку после перенумерования
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	Перем РезультатПроверки;
	
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;	
	КонецЕсли;	
	
	Элементы.СтраницаБиржевыеСделки.Видимость					= Ложь;
	Элементы.СтраницаБиржевыеСделкиРЕПО.Видимость				= Ложь;
	Элементы.СтраницаВнебиржевыеСделки.Видимость				= Ложь;
	Элементы.СтраницаПоручения.Видимость						= Ложь;
	Элементы.СтраницаИныеОперации.Видимость						= Ложь;
	Элементы.СтраницаПомеченныеНаУдалениеДокументы.Видимость	= Ложь;
	
	// Очищаем старые результаты
	ЭтаФорма.БиржевыеСделки.ПолучитьЭлементы().Очистить();
	ЭтаФорма.БиржевыеСделкиРЕПО.ПолучитьЭлементы().Очистить();
	ЭтаФорма.ВнебиржевыеСделки.ПолучитьЭлементы().Очистить();
	ЭтаФорма.Поручения.ПолучитьЭлементы().Очистить();
	ЭтаФорма.ИныеОперации.ПолучитьЭлементы().Очистить();
	
	Если АдресаСохраненныхДанных <> Неопределено Тогда
		Для Каждого АдресСохраненныхДанных Из АдресаСохраненныхДанных Цикл
			УдалитьИзВременногоХранилища(АдресСохраненныхДанных.Значение);	
		КонецЦикла;
	КонецЕсли;
	АдресаСохраненныхДанных = Новый Структура;
	
	// Определяем методику нумерации по периоду
	Если Объект.Период.ДатаНачала < '20171001' И Объект.Период.ДатаОкончания >= '20171001' Тогда
		Сообщить("Период " + Строка(Объект.Период) + " включает разные методики нумерации документов!");
		Возврат;	
	КонецЕсли;
	
	Если Объект.Период.ДатаНачала < '20171001' И ЗначениеЗаполнено(Объект.СчетДоверительногоУправления) Тогда
		Сообщить("Методика нумерации с отбором по счету внутреннего учета до 01.10.2017 не определена!");
		Возврат;	
	КонецЕсли;
		
	// Выполняем проверку
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ПроверитьНомераДокументов(РезультатПроверки, ЭтаФорма.ТолькоТребующиеПеренумерации);
	
	Если РезультатПроверки = Неопределено Тогда
		Возврат;
	КонецЕсли;

	// Выводим ошибки
	Для Каждого ТекстОшибки Из РезультатПроверки.Ошибки Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЦикла;
	
	// Биржевые сделки
	Если РезультатПроверки.Свойство("БиржевыеСделки") Тогда
		АдресаСохраненныхДанных.Вставить("БиржевыеСделки", ПоместитьВоВременноеХранилище(РезультатПроверки.БиржевыеСделки.Данные, ЭтаФорма.УникальныйИдентификатор));		
		ЗначениеВРеквизитФормы(РезультатПроверки.БиржевыеСделки.Данные, "БиржевыеСделки");
		Элементы.СтраницаБиржевыеСделки.Заголовок = "Биржевые сделки (" + РезультатПроверки.БиржевыеСделки.ТребуютПеренумерации + "/" + РезультатПроверки.БиржевыеСделки.ВсегоДокументов + ")";
		Элементы.СтраницаБиржевыеСделки.Видимость = Истина;
	КонецЕсли;
	
	// Биржевые сделки РЕПО
	Если РезультатПроверки.Свойство("БиржевыеСделкиРЕПО") Тогда
		АдресаСохраненныхДанных.Вставить("БиржевыеСделкиРЕПО", ПоместитьВоВременноеХранилище(РезультатПроверки.БиржевыеСделкиРЕПО.Данные, ЭтаФорма.УникальныйИдентификатор));		
		ЗначениеВРеквизитФормы(РезультатПроверки.БиржевыеСделкиРЕПО.Данные, "БиржевыеСделкиРЕПО");
		Элементы.СтраницаБиржевыеСделкиРЕПО.Заголовок = "Биржевые сделки РЕПО (" + РезультатПроверки.БиржевыеСделкиРЕПО.ТребуютПеренумерации + "/" + РезультатПроверки.БиржевыеСделкиРЕПО.ВсегоДокументов + ")";
		Элементы.СтраницаБиржевыеСделкиРЕПО.Видимость = Истина;
	КонецЕсли;	
	
	// Биржевые сделки РЕПО
	Если РезультатПроверки.Свойство("ВнебиржевыеСделки") Тогда
		АдресаСохраненныхДанных.Вставить("ВнебиржевыеСделки", ПоместитьВоВременноеХранилище(РезультатПроверки.ВнебиржевыеСделки.Данные, ЭтаФорма.УникальныйИдентификатор));		
		ЗначениеВРеквизитФормы(РезультатПроверки.ВнебиржевыеСделки.Данные, "ВнебиржевыеСделки");
		Элементы.СтраницаВнебиржевыеСделки.Заголовок = "Внебиржевые сделки (" + РезультатПроверки.ВнебиржевыеСделки.ТребуютПеренумерации + "/" + РезультатПроверки.ВнебиржевыеСделки.ВсегоДокументов + ")";
		Элементы.СтраницаВнебиржевыеСделки.Видимость = Истина;
	КонецЕсли;	
	
	// Поручения
	Если РезультатПроверки.Свойство("Поручения") Тогда
		АдресаСохраненныхДанных.Вставить("Поручения", ПоместитьВоВременноеХранилище(РезультатПроверки.Поручения.Данные, ЭтаФорма.УникальныйИдентификатор));		
		ЗначениеВРеквизитФормы(РезультатПроверки.Поручения.Данные, "Поручения");
		Элементы.СтраницаПоручения.Заголовок = "Поручения (" + РезультатПроверки.Поручения.ТребуютПеренумерации + "/" + РезультатПроверки.Поручения.ВсегоДокументов + ")";
		Элементы.СтраницаПоручения.Видимость = Истина;
	КонецЕсли;
	
	// Иные операции
	Если РезультатПроверки.Свойство("ИныеОперации") Тогда
		АдресаСохраненныхДанных.Вставить("ИныеОперации", ПоместитьВоВременноеХранилище(РезультатПроверки.ИныеОперации.Данные, ЭтаФорма.УникальныйИдентификатор));		
		ЗначениеВРеквизитФормы(РезультатПроверки.ИныеОперации.Данные, "ИныеОперации");
		Элементы.СтраницаИныеОперации.Заголовок = ?(Объект.Период.ДатаНачала >= '20171001', "Все операции (", "Иные операции (") + РезультатПроверки.ИныеОперации.ТребуютПеренумерации + "/" + РезультатПроверки.ИныеОперации.ВсегоДокументов + ")";
		Элементы.СтраницаИныеОперации.Видимость = Истина;
	КонецЕсли;
	
	// Помеченные на удаление документы
	Если РезультатПроверки.Свойство("ПомеченныеНаУдалениеДокументы") Тогда
		Если РезультатПроверки.ПомеченныеНаУдалениеДокументы.ТребуютПеренумерации > 0 Тогда
			АдресаСохраненныхДанных.Вставить("ПомеченныеНаУдалениеДокументы", ПоместитьВоВременноеХранилище(РезультатПроверки.ПомеченныеНаУдалениеДокументы.Данные, ЭтаФорма.УникальныйИдентификатор));		
			ЗначениеВРеквизитФормы(РезультатПроверки.ПомеченныеНаУдалениеДокументы.Данные, "ПомеченныеНаУдалениеДокументы");
			Элементы.СтраницаПомеченныеНаУдалениеДокументы.Заголовок = "Помеченные на удаление (" + РезультатПроверки.ПомеченныеНаУдалениеДокументы.ТребуютПеренумерации + "/" + РезультатПроверки.ПомеченныеНаУдалениеДокументы.ВсегоДокументов + ")";
			Элементы.СтраницаПомеченныеНаУдалениеДокументы.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ФормаКомандаПеренумеровать.Доступность = Не ЗначениеЗаполнено(РезультатПроверки.Ошибки);
КонецПроцедуры

&НаСервере
Функция НайтиРасхожденияНаСервере()
	
	Если АдресаСохраненныхДанных = Неопределено Тогда
		
		// Восстанавливаем результаты проверки из данных формы	
		
		РезультатПроверки = Новый Структура("БиржевыеСделки,БиржевыеСделкиРЕПО,ВнебиржевыеСделки,Поручения,ИныеОперации",
			Новый Структура("Данные", РеквизитФормыВЗначение("БиржевыеСделки")),
			Новый Структура("Данные", РеквизитФормыВЗначение("БиржевыеСделкиРЕПО")),
			Новый Структура("Данные", РеквизитФормыВЗначение("ВнебиржевыеСделки")),
			Новый Структура("Данные", РеквизитФормыВЗначение("Поручения")),
			Новый Структура("Данные", РеквизитФормыВЗначение("ИныеОперации"))
		);
		
	Иначе
		
		// Берем сохраненные данные из временного хранилища
		
		РезультатПроверки = Новый Структура;
		Для Каждого АдресСохраненныхДанных Из АдресаСохраненныхДанных Цикл
			РезультатПроверки.Вставить(АдресСохраненныхДанных.Ключ, Новый Структура("Данные", ПолучитьИзВременногоХранилища(АдресСохраненныхДанных.Значение)));
		КонецЦикла;
		
	КонецЕсли;
	
	ОтчетОРасхождении = Обработки.НумерацияДокументов.СформироватьОтчетОРасхождениях(РезультатПроверки);
	
	Возврат ОтчетОРасхождении;

КонецФункции

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";
	
	Если Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Объект.Период,,, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Объект.Период", Отказ); 	
	КонецЕсли;
	
КонецПроцедуры
